Revit 2016 API
Floor.StructuralUsage Property
The floors designated structural usage, such as bearing or non bearing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
[ObsoleteAttribute("Obsolete in Revit 2016. To get/set information about the structural usage of a Floor, obtain its AnalyticalModel from GetAnalyticalModel(), and if there is a valid AnalyticalModel, get/set the AnalyzeAs setting for the floor with AnalyticalModel.GetAnalyzeAs()/AnalyticalModel.SetAnalyzeAs().")]
public SlabFoundationType StructuralUsage { get; set; }
Visual Basic
<ObsoleteAttribute("Obsolete in Revit 2016. To get/set information about the structural usage of a Floor, obtain its AnalyticalModel from GetAnalyticalModel(), and if there is a valid AnalyticalModel, get/set the AnalyzeAs setting for the floor with AnalyticalModel.GetAnalyzeAs()/AnalyticalModel.SetAnalyzeAs().")> _
Public Property StructuralUsage As SlabFoundationType
	Get
	Set
Visual C++
[ObsoleteAttribute(L"Obsolete in Revit 2016. To get/set information about the structural usage of a Floor, obtain its AnalyticalModel from GetAnalyticalModel(), and if there is a valid AnalyticalModel, get/set the AnalyzeAs setting for the floor with AnalyticalModel.GetAnalyzeAs()/AnalyticalModel.SetAnalyzeAs().")]
public:
property SlabFoundationType StructuralUsage {
	SlabFoundationType get ();
	void set (SlabFoundationType value);
}
Remarks
The StructuralUsage property is a read only property that returns the walls designated usage. Example values of this property are Non Bearing, Bearing, Shear, Combined etc.
See Also
Floor Class
Autodesk.Revit.DB Namespace